[
  {
    "title": "Ubiquitous Analytics: Interacting with Big Data Anywhere, Anytime",
    "advisors": [
      "Niklas Elmqvist"
    ],
    "abstract": "This project envisions leveraging ecosystems of digital devices, including large high-resolution displays, tabletop displays, handheld devices, and augmented reality displays, to support collaborative sensemaking during crisis situations. The research challenges for this include designing universal interfaces that combine multiple devices, developing flexible visual representations that can seamlessly migrate between devices, building ecosystems of devices while supporting computational and storage requirements, and enabling analysts efficiently work together.",
    "publications": ["IEEE VAST 2016", "IEEE TVCG 2015", "ACM ITS 2014", "IEEE CG&A 2014", "IJHCS 2014"],
    "name": "ubilytics",
    "comments": "PhD dissertation topic"
  },
  {
    "title": "Mixed-Initiative Interaction for Visual Analytics",
    "advisors": [
      "Niklas Elmqvist",
      "David Ebert"
    ],
    "abstract": "This project aims at closely coupling computational models, such as from machine learning, data mining, and natural language processing, with visual data exploration. This creates mixed-initiative approaches for visual analytics where the machine uncovers intelligent pathways, makes observations, and creates representations of the data, while the analysts make decisions to guide the machine based on their high-level goals, hypotheses, knowledge, and intuition. We currently explored such a visual analytics approach for time-series prediction (called TimeFork).",
    "publications": ["ACM CHI 2016"],
    "name": "mixed-initiative"
  },
  {
    "title": "Progressive Visual Analytics",
    "advisors": [
      "Niklas Elmqvist",
      "Jean-Daniel Fekete"
    ],
    "abstract": "Traditional visual analytics systems face challenges with latency when dealing with large datasets and complex computations. Considering that humans cannot maintain their attention when system response time exceeds approximately 10 seconds, we need alternative ways to create responsive visual analytics systems. This project targets creating such systems by taking advantage of a progressive paradigm involves intermediate results and incremental data processing. Visualizing these intermediate results, associated uncertainities, and corresponding feedback and control options is the challenge in this project.",
    "publications": ["ACM CHI 2017 (in review)"],
    "name": "progressiveVA"
  },
  {
    "title": "Natural Interaction Spaces for Collaborative Design",
    "advisors": [
      "Niklas Elmqvist",
      "Lorraine Kisselburgh",
      "Karthik Ramani"
    ],
    "abstract": "The goal of this project is to create exploratory environments that holistically support early design-driven innovation, especially concerning products, for groups of designers. This includes taking advantage of natural interaction technologies including large multi-touch displays, handheld direct-touch devices, and activity sensors in a coherent design environment. Furthermore, this  includes developing storage and history management platforms to keep track of the design process (which is traditionally done by sketching on paper and storyboarding).",
    "publications": ["ACM CHI 2014", "ASME IDETC/DIC 2014", "IJHCS 2014"],
    "name": "nuidesign",
    "comments": "Masters thesis topic"
  }
]