[
  {
    "title": "Understanding Embeddings Through Epic Fantasy",
    "abstract": "A journey through the world of embeddings, illustrated with epic fantasy literature and interactive visualizations. Learn how embeddings transform text into numerical vectors that capture meaning and relationships, using examples from The Wheel of Time, Mistborn, and other fantasy series.",
    "link": "/blog/understanding-embeddings",
    "image": {
      "dark": "understanding-embeddings-dark.png",
      "light": "understanding-embeddings-light.png"
    },
    "type": "Blog Post",
    "date": "May 11, 2025"
  },
  {
    "title": "Vistrates: A Versatile Tool for Data Analytics in the World of On-Device Intelligence",
    "abstract": "Introducing a platform for many activities in data exploration between multiple users on heterogeneous devices. Vistrates is web-based and collaborative by nature, thus supporting data analysis anywhere, anytime, and by anyone.",
    "link": "http://hcil.umd.edu/vistrates/",
    "video": "https://www.youtube.com/watch?v=nMmiWBJoJUc",
    "image": "vistrates.png",
    "type": "Blog Post",
    "date": "Oct 22, 2018"
  },
  {
    "title": "Elastic Documents: Reading Data-Rich Documents with Generated Visualizations",
    "abstract": "Linking text and tables through contextual visualizations in data-rich documents improves reading comprehension. Our user evaluations have shown the power of this new approach in summarization and comprehension of data-rich documents.",
    "link": "http://hcil.umd.edu/document-reading-with-visual-aids/",
    "video": "https://vimeo.com/289784966",
    "name": "elasticdocs",
    "type": "Blog Post",
    "date": "Oct 21, 2018"
  },
  {
    "title": "TimeFork: Exploring Multiple Futures in the Stock Market with Generative Models",
    "abstract": "A new tool called TimeFork uses interactive graphics and state-of-the-art statistical models to allow traders to investigate multiple parallel universes for predicting the stock market.",
    "link": "http://hcil.umd.edu/back-to-the-future-exploring-multiple-futures-in-the-stock-market/",
    "video": "https://www.youtube.com/watch?v=nUfSqqbaD5k",
    "image": "timefork.png",
    "type": "Blog Post",
    "date": "May 12, 2016"
  },

  {
    "title": "When David Meets Goliath: Using Smartwatches and Large Displays Together for Data Analysis",
    "abstract": "New conceptual framework developed at University of Maryland and Technische Universität Dresden helps utilize multiple devices together for visual data analysis.",
    "link": "http://hcil.umd.edu/when-david-meets-goliath-using-smartwatches-and-large-displays-together-for-data-analysis/",
    "video": "https://www.youtube.com/watch?v=DYSvA_Hn39o",
    "name": "DG",
    "type": "Blog Post",
    "date": "April 18, 2018"
  }
]
